devdnl/dnx-rtos/src/system/drivers/can/stm32f1/can.c
/*==============================================================================
File    can.c

Author  Daniel Zorychta

Brief   CAN driver

        Copyright (C) 2018 Daniel Zorychta <daniel.zorychta@gmail.com>

        This program is free software; you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation and modified by the dnx RTOS exception.

        NOTE: The modification  to the GPL is  included to allow you to
              distribute a combined work that includes dnx RTOS without
              being obliged to provide the source  code for proprietary
              components outside of the dnx RTOS.

        The dnx RTOS  is  distributed  in the hope  that  it will be useful,
        but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
        MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
        GNU General Public License for more details.

        Full license text is available on the following file: doc/license.txt.

==============================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "stm32f1/can_cfg.h"
#include "stm32f1/stm32f10x.h"
#include "../can_ioctl.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define TX_MAILBOXES    3
#define RX_MAILBOXES    2
#define RX_FIFO_DEPTH   3
#define INIT_TIMEOUT    1000
#define MTX_TIMEOUT     1000

#if defined(STM32F10X_LD) || defined(STM32F10X_MD) || defined(STM32F10X_HD)\
 || defined(STM32F10X_XL)
#define CAN1_TX_IRQN            USB_HP_CAN1_TX_IRQn
#define CAN1_RX0_IRQN           USB_LP_CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      USB_HP_CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     USB_LP_CAN1_RX0_IRQHandler
#endif

#ifdef STM32F10X_CL
#define CAN1_TX_IRQN            CAN1_TX_IRQn
#define CAN1_RX0_IRQN           CAN1_RX0_IRQn
#define CAN1_TX_IRQHANDLER      CAN1_TX_IRQHandler
#define CAN1_RX0_IRQHANDLER     CAN1_RX0_IRQHandler
#endif

/*==============================================================================
  Local object types
==============================================================================*/
typedef struct {
        u32_t    send_timeout;
        u32_t    recv_timeout;
        u32_t    txpend_ctr;
        u32_t    rxpend_ctr;
        mutex_t *config_mtx;
        mutex_t *txmbox_mtx[TX_MAILBOXES];
        queue_t *txrdy_q[TX_MAILBOXES];
        queue_t *rxqueue_q;
} CANM_t;

/*==============================================================================
  Local function prototypes
==============================================================================*/
static void relese_resources(CANM_t *hdl);
static int configure(CANM_t *hdl, const CAN_config_t *cfg);
static int set_init_mode(CANM_t *hdl);
static int set_normal_mode(CANM_t *hdl);
static int set_sleep_mode(CANM_t *hdl);
static int set_filter(CANM_t *hdl, const CAN_filter_t *filter);
static int send_msg(CANM_t *hdl, const CAN_msg_t *msg);
static int recv_msg(CANM_t *hdl, CAN_msg_t *msg);

/*==============================================================================
  Local object
==============================================================================*/
MODULE_NAME(CAN);

static CANM_t *CANM;

/*==============================================================================
  Exported object
==============================================================================*/

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device.
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_INIT(CAN, void **device_handle, u8_t major, u8_t minor)
{
        int err = EINVAL;

        if (major == 0 && minor == 0) {

                err = sys_zalloc(sizeof(CANM_t), device_handle);
                if (!err) {

                        CANM_t *hdl = *device_handle;

                        hdl->recv_timeout = MAX_DELAY_MS;
                        hdl->send_timeout = 0;

                        err = sys_mutex_create(MUTEX_TYPE_RECURSIVE, &hdl->config_mtx);
                        if (err) {
                                goto finish;
                        }

                        err = sys_queue_create(RX_MAILBOXES * RX_FIFO_DEPTH,
                                               sizeof(CAN_FIFOMailBox_t),
                                               &hdl->rxqueue_q);
                        if (err) {
                                goto finish;
                        }

                        for (int i = 0; i < TX_MAILBOXES; i++) {
                                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &hdl->txmbox_mtx[i]);
                                if (err) {
                                        goto finish;
                                }

                                err = sys_queue_create(1, sizeof(int), &hdl->txrdy_q[i]);
                                if (err) {
                                        goto finish;
                                }
                        }

                        SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN1EN);
                        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_CAN1RST);
                        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_CAN1RST);

                        SET_BIT(CAN1->MCR, CAN_MCR_RESET);
                        CLEAR_BIT(CAN1->MCR, CAN_MCR_RESET);

                        NVIC_ClearPendingIRQ(CAN1_TX_IRQN);
                        NVIC_EnableIRQ(CAN1_TX_IRQN);
                        NVIC_SetPriority(CAN1_TX_IRQN, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CAN1_RX0_IRQN);
                        NVIC_EnableIRQ(CAN1_RX0_IRQN);
                        NVIC_SetPriority(CAN1_RX0_IRQN, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CAN1_RX1_IRQn);
                        NVIC_EnableIRQ(CAN1_RX1_IRQn);
                        NVIC_SetPriority(CAN1_RX1_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        NVIC_ClearPendingIRQ(CAN1_SCE_IRQn);
                        NVIC_EnableIRQ(CAN1_SCE_IRQn);
                        NVIC_SetPriority(CAN1_SCE_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                        err = set_init_mode(hdl);
                        if (err) {
                                goto finish;
                        }

                        finish:
                        if (!err) {
                                CANM = hdl;

                        } else {
                                relese_resources(hdl);
                        }
                }
        }

