devdnl/dnx-rtos/src/system/drivers/can/stm32f1/can.c
        return err;
}

//==============================================================================
/**
 * @brief IO control.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_IOCTL(CAN, void *device_handle, int request, void *arg)
{
        CANM_t *hdl = device_handle;

        if (CANM == NULL) {
                return ENXIO;
        }

        int err = EINVAL;

        switch (request) {
        case IOCTL_CAN__CONFIGURE:
                if (arg) {
                        err = configure(hdl, arg);
                }
                break;

        case IOCTL_CAN__SET_FILTER:
                if (arg) {
                        err = set_filter(hdl, arg);
                }
                break;

        case IOCTL_CAN__SET_MODE:
                if (arg) {
                        CAN_mode_t mode = *cast(CAN_mode_t*, arg);
                        switch (mode) {
                        case CAN_MODE__INIT  : err = set_init_mode(hdl); break;
                        case CAN_MODE__NORMAL: err = set_normal_mode(hdl); break;
                        case CAN_MODE__SLEEP : err = set_sleep_mode(hdl); break;
                        default              : err = EINVAL; break;
                        }
                }
                break;

        case IOCTL_CAN__SET_SEND_TIMEOUT:
                if (arg) {
                        hdl->send_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SET_RECV_TIMEOUT:
                if (arg) {
                        hdl->recv_timeout = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_CAN__SEND_MSG:
                if (arg) {
                        err = send_msg(hdl, arg);
                }
                break;

        case IOCTL_CAN__RECV_MSG:
                if (arg) {
                        err = recv_msg(hdl, arg);
                }
                break;

        default:
                err = EBADRQC;
                break;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device.
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_FLUSH(CAN, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_STAT(CAN, void *device_handle, struct vfs_dev_stat *device_stat)
{
        CANM_t *hdl = device_handle;

        size_t items = 0;
        sys_queue_get_number_of_items(hdl->rxqueue_q, &items);

        device_stat->st_size = items * sizeof(CAN_msg_t);

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Release resources allocated by module.
 *
 * @param  hdl          module instance
 */
//==============================================================================
static void relese_resources(CANM_t *hdl)
{
        NVIC_DisableIRQ(CAN1_TX_IRQN);
        NVIC_DisableIRQ(CAN1_RX0_IRQN);
        NVIC_DisableIRQ(CAN1_RX1_IRQn);
        NVIC_DisableIRQ(CAN1_SCE_IRQn);

        SET_BIT(CAN1->MCR, CAN_MCR_RESET);
        CLEAR_BIT(CAN1->MCR, CAN_MCR_RESET);

        SET_BIT(RCC->APB1RSTR, RCC_APB1RSTR_CAN1RST);
        CLEAR_BIT(RCC->APB1RSTR, RCC_APB1RSTR_CAN1RST);

        CLEAR_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN1EN);

        if (hdl->config_mtx) {
                sys_mutex_destroy(hdl->config_mtx);
        }

        if (hdl->rxqueue_q) {
                sys_queue_destroy(hdl->rxqueue_q);
        }

        for (int i = 0; i < TX_MAILBOXES; i++) {
                if (hdl->txmbox_mtx[i]) {
                        sys_mutex_destroy(hdl->txmbox_mtx[i]);
                }

                if (hdl->txrdy_q[i]) {
                        sys_queue_destroy(hdl->txrdy_q[i]);
                }
        }

        sys_free((void*)&hdl);
}

//==============================================================================
/**
 * @brief  Configure peripheral.
 *
 * @param  hdl          module instance
 * @param  cfg          configuration
 *
 * @return One of errno value.
 */
//==============================================================================
static int configure(CANM_t *hdl, const CAN_config_t *cfg)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                SET_BIT(CAN1->MCR, (CAN_MCR_DBF * _CAN_CFG__DEBUG_FREEZE)
                                 | CAN_MCR_TXFP
                                 | CAN_MCR_RFLM);

                SET_BIT(CAN1->IER, CAN_IER_FMPIE1
                                 | CAN_IER_FMPIE0
                                 | CAN_IER_TMEIE);

                if (cfg->auto_bus_off_management) {
                        SET_BIT(CAN1->MCR, CAN_MCR_ABOM);
                } else {
                        CLEAR_BIT(CAN1->MCR, CAN_MCR_ABOM);
                }

                if (cfg->auto_retransmission) {
                        CLEAR_BIT(CAN1->MCR, CAN_MCR_NART);
                } else {
                        SET_BIT(CAN1->MCR, CAN_MCR_NART);
                }

                if (cfg->auto_wake_up) {
                        SET_BIT(CAN1->MCR, CAN_MCR_AWUM);
                } else {
                        CLEAR_BIT(CAN1->MCR, CAN_MCR_AWUM);
                }

                if (cfg->time_triggered_comm) {
                        SET_BIT(CAN1->MCR, CAN_MCR_TTCM);
                } else {
                        CLEAR_BIT(CAN1->MCR, CAN_MCR_TTCM);
                }

                if (cfg->loopback) {
                        SET_BIT(CAN1->BTR, CAN_BTR_LBKM);
                } else {
                        CLEAR_BIT(CAN1->BTR, CAN_BTR_LBKM);
                }

                if (cfg->silent) {
                        SET_BIT(CAN1->BTR, CAN_BTR_SILM);
                } else {
                        CLEAR_BIT(CAN1->BTR, CAN_BTR_SILM);
                }

                u32_t SJW = min(3, cfg->SJW - 1) << 24;
                u32_t TS2 = min(7, cfg->TS2 - 1) << 20;
                u32_t TS1 = min(15, cfg->TS1 - 1) << 16;
                u32_t BRP = min(1023, cfg->prescaler - 1);

                CAN1->BTR = (CAN_BTR_LBKM * cfg->loopback)
                          | (CAN_BTR_SILM * cfg->silent)
                          | SJW | TS2 | TS1 | BRP;

                sys_mutex_unlock(hdl->config_mtx);
        }

