devdnl/dnx-rtos/src/system/drivers/can/stm32f1/can.c
        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to initialization mode.
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_init_mode(CANM_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                u32_t tref = sys_get_uptime_ms();

                CLEAR_BIT(CAN1->MCR, CAN_MCR_SLEEP);
                SET_BIT(CAN1->MCR, CAN_MCR_INRQ);

                while (not sys_time_is_expired(tref, INIT_TIMEOUT)) {
                        if (CAN1->MSR & CAN_MSR_INAK) {
                                err = ESUCC;
                                break;
                        }
                }

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to normal mode (active).
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_normal_mode(CANM_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                err = EIO;

                u32_t tref = sys_get_uptime_ms();

                CLEAR_BIT(CAN1->FMR, CAN_FMR_FINIT);
                CLEAR_BIT(CAN1->MCR, CAN_MCR_INRQ | CAN_MCR_SLEEP);

                while (not sys_time_is_expired(tref, INIT_TIMEOUT)) {
                        if (!(CAN1->MSR & CAN_MSR_INAK)) {
                                err = ESUCC;
                                break;
                        }
                }

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set CAN controller to sleep mode.
 *
 * @param  hdl          module instance
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_sleep_mode(CANM_t *hdl)
{
        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                SET_BIT(CAN1->MCR, CAN_MCR_SLEEP);
                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Set acceptance filter.
 *
 * @param  hdl          module instance
 * @param  filter       filter configuration
 *
 * @return One of errno value.
 */
//==============================================================================
static int set_filter(CANM_t *hdl, const CAN_filter_t *filter)
{
        if (filter->number >= 14) {
                return EINVAL;
        }

        int err = sys_mutex_lock(hdl->config_mtx, MTX_TIMEOUT);
        if (!err) {
                u32_t CAN2SB = 14;
                CAN1->FMR = (CAN2SB << 24) | CAN_FMR_FINIT;

                if (filter->mask) {
                        CLEAR_BIT(CAN1->FM1R, CAN_FM1R_FBM0 << filter->number);
                } else {
                        SET_BIT(CAN1->FM1R, CAN_FM1R_FBM0 << filter->number);
                }

                // 32b ID
                SET_BIT(CAN1->FS1R, CAN_FS1R_FSC0 << filter->number);

                // FIFO0: odd filters, FIFO1: even filters)
                WRITE_REG(CAN1->FFA1R, 0xAAAAAAAA);

                // set ID and mask
                CAN1->sFilterRegister[filter->number].FR1 = filter->ID1;
                CAN1->sFilterRegister[filter->number].FR2 = filter->ID2_mask;

                SET_BIT(CAN1->FA1R, CAN_FA1R_FACT0 << filter->number);

                sys_mutex_unlock(hdl->config_mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function send CAN message.
 *
 * @param  hdl          module instance
 * @param  msg          message to send
 *
 * @return One of errno value.
 */
//==============================================================================
static int send_msg(CANM_t *hdl, const CAN_msg_t *msg)
{
        sys_context_switch_lock();
        hdl->txpend_ctr++;
        sys_context_switch_unlock();

        int   err     = ETIME;
        bool  loop    = true;
        u32_t timeout = max(1, msg->timeout_ms);

        u32_t tref = sys_get_uptime_ms();

        while (CANM && loop && !sys_time_is_expired(tref, timeout)) {

                err = ETIME;

                for (int i = 0; CANM && loop && (i < TX_MAILBOXES); i++) {

                        err = sys_mutex_trylock(hdl->txmbox_mtx[i]);
                        if (!err) {
                                CAN_TxMailBox_t *mbox = &CAN1->sTxMailBox[i];

                                if (!(mbox->TIR & CAN_TI0R_TXRQ)) {
                                        mbox->TIR = CAN_TI0R_RTR * msg->remote_transmission;

                                        if (msg->extended_ID) {
                                                mbox->TIR |= (msg->ID << 3);
                                                mbox->TIR |= CAN_TI0R_IDE;
                                        } else {
                                                mbox->TIR |= (msg->ID << 21);
                                        }

                                        mbox->TDTR = min(8, msg->data_length) & CAN_TDT0R_DLC;

                                        mbox->TDLR = msg->data[0] << 0
                                                   | msg->data[1] << 8
                                                   | msg->data[2] << 16
                                                   | msg->data[3] << 24;

                                        mbox->TDHR = msg->data[4] << 0
                                                   | msg->data[5] << 8
                                                   | msg->data[6] << 16
                                                   | msg->data[7] << 24;

                                        sys_queue_reset(hdl->txrdy_q[i]);

                                        SET_BIT(mbox->TIR, CAN_TI0R_TXRQ);

                                        int erri = EIO;
                                        err = sys_queue_receive(hdl->txrdy_q[i], &erri, timeout);
                                        if (!err) {
                                                err = erri;

                                        } else {
                                                printk("CAN: message send abort");
                                                SET_BIT(CAN1->TSR, CAN_TSR_ABRQ0 << (i * 8));
                                                sys_sleep_ms(1);
                                        }

                                        loop = false;
                                } else {
                                        err = EBUSY;
                                }

                                sys_mutex_unlock(hdl->txmbox_mtx[i]);
                        }
                }

                if (loop) {
                        sys_sleep_ms(1);
                }
        }

        sys_context_switch_lock();
        hdl->txpend_ctr--;
        sys_context_switch_unlock();

