devdnl/dnx-rtos/src/system/drivers/can/stm32f1/can.c
        return err;
}

//==============================================================================
/**
 * @brief  Receive message.
 *
 * @param  hdl          module instance
 * @param  msg          message container to receive to
 *
 * @return One of errno value.
 */
//==============================================================================
static int recv_msg(CANM_t *hdl, CAN_msg_t *msg)
{
        sys_context_switch_lock();
        hdl->rxpend_ctr++;
        sys_context_switch_unlock();

        CAN_FIFOMailBox_t mbox;

        int err = sys_queue_receive(hdl->rxqueue_q, &mbox, msg->timeout_ms);
        if (!err) {
                if (mbox.RIR & CAN_RI0R_IDE) {
                        msg->ID = mbox.RIR >> 3;
                        msg->extended_ID = true;
                } else {
                        msg->ID = mbox.RIR >> 21;
                        msg->extended_ID = false;
                }

                msg->remote_transmission = mbox.RIR & CAN_RI0R_RTR;
                msg->data_length         = mbox.RDTR & CAN_RDT0R_DLC;
                msg->data[0]             = mbox.RDLR >> 0;
                msg->data[1]             = mbox.RDLR >> 8;
                msg->data[2]             = mbox.RDLR >> 16;
                msg->data[3]             = mbox.RDLR >> 24;
                msg->data[4]             = mbox.RDHR >> 0;
                msg->data[5]             = mbox.RDHR >> 8;
                msg->data[6]             = mbox.RDHR >> 16;
                msg->data[7]             = mbox.RDHR >> 24;
        }

        sys_context_switch_lock();
        hdl->rxpend_ctr--;
        sys_context_switch_unlock();

        return err;
}

//==============================================================================
/**
 * @brief CAN TX ready IRQ.
 */
//==============================================================================
void CAN1_TX_IRQHANDLER(void)
{
        bool yield = false;

        static const u32_t CAN_TSR_RQCP[TX_MAILBOXES] = {CAN_TSR_RQCP0,
                                                         CAN_TSR_RQCP1,
                                                         CAN_TSR_RQCP2};

        static const u32_t CAN_TSR_TERR[TX_MAILBOXES] = {CAN_TSR_TERR0,
                                                         CAN_TSR_TERR1,
                                                         CAN_TSR_TERR2};

        static const u32_t CAN_TSR_ALST[TX_MAILBOXES] = {CAN_TSR_ALST0,
                                                         CAN_TSR_ALST1,
                                                         CAN_TSR_ALST2};

        static const u32_t CAN_TSR_TXOK[TX_MAILBOXES] = {CAN_TSR_TXOK0,
                                                         CAN_TSR_TXOK1,
                                                         CAN_TSR_TXOK2};

        for (int i = 0; i < TX_MAILBOXES; i++) {

                if (CAN1->TSR & CAN_TSR_RQCP[i]) {

                        int err = EIO;

                        if (CAN1->TSR & CAN_TSR_TERR[i]) {
                                err = EIO;
                        } else if (CAN1->TSR & CAN_TSR_ALST[i]) {
                                err = EAGAIN;
                        } else if (CAN1->TSR & CAN_TSR_TXOK[i]) {
                                err = ESUCC;
                        }

                        SET_BIT(CAN1->TSR, CAN_TSR_RQCP[i]);

                        bool woken = false;
                        sys_queue_send_from_ISR(CANM->txrdy_q[i], &err, &woken);

                        yield |= woken;
                }
        }

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief CAN FIFO0 Rx IRQ.
 */
//==============================================================================
void CAN1_RX0_IRQHANDLER(void)
{
        bool yield = false;

        sys_queue_send_from_ISR(CANM->rxqueue_q, &CAN1->sFIFOMailBox[0], &yield);

        SET_BIT(CAN1->RF0R, CAN_RF0R_RFOM0);

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief CAN FIFO1 Rx IRQ.
 */
//==============================================================================
void CAN1_RX1_IRQHandler(void)
{
        bool yield = false;

        sys_queue_send_from_ISR(CANM->rxqueue_q, &CAN1->sFIFOMailBox[1], &yield);

        SET_BIT(CAN1->RF1R, CAN_RF0R_RFOM0);

        sys_thread_yield_from_ISR(yield);
}

//==============================================================================
/**
 * @brief Bus change IRQ.
 */
//==============================================================================
void CAN1_SCE_IRQHandler(void)
{

}

/*==============================================================================
  End of file
==============================================================================*/
